-- phpMyAdmin SQL Dump
-- version 4.9.0.1
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Сен 19 2019 г., 01:44
-- Версия сервера: 10.3.16-MariaDB
-- Версия PHP: 7.3.7

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `chat`
--

-- --------------------------------------------------------

--
-- Структура таблицы `friends`
--

CREATE TABLE `friends` (
  `user_1` int(11) NOT NULL,
  `user_2` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `friends`
--

INSERT INTO `friends` (`user_1`, `user_2`) VALUES
(2, 1),
(2, 3),
(20, 3),
(20, 6);

-- --------------------------------------------------------

--
-- Структура таблицы `polzovateli`
--

CREATE TABLE `polzovateli` (
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL,
  `id` int(11) NOT NULL,
  `name` varchar(100) NOT NULL,
  `phone` varchar(20) NOT NULL,
  `photo` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `polzovateli`
--

INSERT INTO `polzovateli` (`email`, `password`, `id`, `name`, `phone`, `photo`) VALUES
('Peter@inbox', 'peter', 1, 'Peter', '123456789', 'images/user.png'),
('Ivan@inbox', 'ivan', 2, 'Ivan', '234567891', 'images/user.png'),
('Kostya@inbox', 'kostya', 3, 'Костя', '345678912', 'images/user.png'),
('Vika@inbox', 'vika', 4, 'Vika', '456789123', 'images/user2.png'),
('Yula@inbox', 'yula', 5, 'Yula', '567891234', 'images/user2.png'),
('Vlad@inbox', 'vlad', 6, 'Vlad', '678912345', 'images/user.png'),
('Evgen@inbox', 'evgen', 7, 'Evgen', '789123456', 'images/user.png'),
('Marina@inbox', 'marina', 8, 'Marina', '891234567', 'images/user2.png'),
('Gleb@inbox', 'gleb', 9, 'Gleb', '912345678', 'images/user.png'),
('Yura@inbox', 'yura', 10, 'Yura', '102345678', 'images/user.png'),
('George@inbox', 'george', 11, 'George', '112345678', 'images/user.png'),
('kevin@inbox', 'kevin', 20, 'Kevin', '', '');

-- --------------------------------------------------------

--
-- Структура таблицы `soobsheniya`
--

CREATE TABLE `soobsheniya` (
  `id` int(11) NOT NULL,
  `kto_user_id` int(11) NOT NULL,
  `komu_user_id` int(11) NOT NULL,
  `text` text NOT NULL,
  `time` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `soobsheniya`
--

INSERT INTO `soobsheniya` (`id`, `kto_user_id`, `komu_user_id`, `text`, `time`) VALUES
(1, 1, 2, 'Привет!', '0000-00-00 00:00:00'),
(2, 2, 1, 'Hi', '0000-00-00 00:00:00'),
(3, 1, 2, 'Как дела?', '0000-00-00 00:00:00'),
(4, 2, 1, 'Отлично. Ты как?', '0000-00-00 00:00:00'),
(5, 1, 2, 'Всё хорошо. Пока', '0000-00-00 00:00:00'),
(6, 2, 1, 'До встречи', '0000-00-00 00:00:00'),
(7, 3, 4, 'Привет!', '0000-00-00 00:00:00'),
(8, 4, 3, 'Hi', '0000-00-00 00:00:00'),
(9, 3, 4, 'Как дела?', '0000-00-00 00:00:00'),
(10, 4, 3, 'Отлично. Ты как?', '0000-00-00 00:00:00'),
(11, 3, 4, 'Всё хорошо. Пока', '0000-00-00 00:00:00'),
(12, 4, 3, 'До встречи', '0000-00-00 00:00:00'),
(13, 5, 6, 'Привет!', '0000-00-00 00:00:00'),
(14, 6, 5, 'Hi', '0000-00-00 00:00:00'),
(15, 5, 6, 'Как дела?', '0000-00-00 00:00:00'),
(16, 6, 5, 'Отлично. Ты как?', '0000-00-00 00:00:00'),
(17, 5, 6, 'Всё хорошо. Пока', '0000-00-00 00:00:00'),
(18, 6, 5, 'До встречи', '0000-00-00 00:00:00'),
(19, 7, 8, 'Привет!', '0000-00-00 00:00:00'),
(20, 8, 7, 'Hi', '0000-00-00 00:00:00'),
(21, 7, 8, 'Как дела?', '0000-00-00 00:00:00'),
(22, 8, 7, 'Отлично. Ты как?', '0000-00-00 00:00:00'),
(23, 7, 8, 'Всё хорошо. Пока', '0000-00-00 00:00:00'),
(24, 8, 7, 'До встречи', '0000-00-00 00:00:00'),
(25, 3, 1, 'Первое сообщение...', '2019-09-11 14:03:41'),
(26, 3, 1, 'Второе сообщение!...', '2019-09-11 15:10:09'),
(27, 3, 1, '3 сообщение\r\n!!!', '2019-09-11 15:19:03'),
(28, 0, 0, 'Первое сообщение\r\n', '2019-09-13 23:42:40'),
(29, 0, 0, 'Первое сообщение', '2019-09-13 23:43:47'),
(30, 0, 0, 'Первое сообщение', '2019-09-13 23:46:13'),
(31, 0, 0, '1 sms', '2019-09-13 23:46:29'),
(32, 0, 0, '1 sms', '2019-09-13 23:47:40'),
(33, 0, 0, '1 sms', '2019-09-13 23:48:02'),
(34, 0, 6, '1 sms', '2019-09-13 23:51:17'),
(35, 0, 6, '1 sms', '2019-09-13 23:52:06'),
(36, 2, 5, '1 sms', '2019-09-13 23:52:19'),
(37, 2, 5, '1 sms', '2019-09-13 23:52:26'),
(38, 0, 0, '1sms', '2019-09-13 23:55:19'),
(39, 8, 5, '1sms', '2019-09-13 23:58:15'),
(40, 8, 5, '1sms', '2019-09-14 00:00:15'),
(41, 0, 0, '1sms', '2019-09-14 00:00:27'),
(42, 2, 5, '1sms', '2019-09-14 00:02:22'),
(43, 20, 7, '1sms', '2019-09-14 00:03:34'),
(44, 20, 7, '1sms', '2019-09-14 00:05:27'),
(45, 20, 7, '1sms', '2019-09-14 00:05:41'),
(46, 20, 7, '1sms', '2019-09-14 00:15:25'),
(47, 20, 2, '1sms', '2019-09-14 00:16:00'),
(48, 20, 2, '1sms', '2019-09-14 00:22:05'),
(49, 2, 20, '2sms', '2019-09-14 00:26:32'),
(50, 20, 2, '3sms', '2019-09-14 00:27:11'),
(51, 2, 3, '3sms', '2019-09-14 01:34:32'),
(52, 2, 3, '3sms', '2019-09-14 01:34:35'),
(53, 0, 0, 'варке', '2019-09-14 09:47:03'),
(54, 20, 1, 'sms\r\n\r\n', '2019-09-16 12:45:39'),
(55, 20, 0, 'sms', '2019-09-16 12:45:52'),
(56, 1, 20, '_sms', '2019-09-16 12:46:39'),
(57, 3, 6, 'sms', '2019-09-16 12:47:19'),
(58, 3, 5, 'sms', '2019-09-16 12:47:28'),
(59, 3, 4, 'sms', '2019-09-16 12:47:35'),
(60, 6, 3, '_sms', '2019-09-16 12:49:26'),
(61, 6, 0, '_sms', '2019-09-16 12:49:33'),
(62, 6, 20, 'sms', '2019-09-16 12:49:48'),
(63, 6, 20, 'sms', '2019-09-16 12:50:22'),
(64, 20, 2, 'Ghbdtn', '2019-09-18 11:14:23'),
(65, 20, 2, 'Ghbdtn', '2019-09-18 11:14:30'),
(71, 2, 1, '', '2019-09-18 22:50:10'),
(72, 2, 1, 'TEST', '2019-09-18 23:00:00'),
(73, 2, 1, 'TTT', '2019-09-18 23:03:11'),
(74, 2, 1, 'TEST', '2019-09-18 23:14:36'),
(75, 2, 1, '2TEST', '2019-09-18 23:19:58'),
(76, 2, 1, '3test', '2019-09-18 23:20:17'),
(77, 2, 1, 'FinalTEST', '2019-09-18 23:24:35'),
(78, 2, 1, 'Yes!!!', '2019-09-18 23:24:47'),
(79, 2, 20, 'A teper??', '2019-09-18 23:25:31'),
(80, 2, 20, 'Ну? И??', '2019-09-18 23:36:16'),
(81, 2, 20, 'снова я', '2019-09-18 23:37:00'),
(82, 2, 1, 'Hello', '2019-09-19 00:09:52'),
(83, 2, 1, 'sms', '2019-09-19 01:00:07'),
(84, 2, 1, '2sms', '2019-09-19 01:00:33'),
(85, 20, 2, 'и я тут как тут', '2019-09-19 02:28:52');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `friends`
--
ALTER TABLE `friends`
  ADD PRIMARY KEY (`user_1`,`user_2`);

--
-- Индексы таблицы `polzovateli`
--
ALTER TABLE `polzovateli`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `soobsheniya`
--
ALTER TABLE `soobsheniya`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `polzovateli`
--
ALTER TABLE `polzovateli`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- AUTO_INCREMENT для таблицы `soobsheniya`
--
ALTER TABLE `soobsheniya`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=86;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
